#Задание переменные:

homeworks_done = 12
number_of_hours = 1.5
course_name = "Python"
time_per_task = number_of_hours / homeworks_done
print('Курс:', course_name+', ' 'всего задач:', str(homeworks_done)+', ''затрачено часов:', str(number_of_hours)+', ' 'среднее время выполнения:', str(time_per_task), 'часа.')

#Курс: Python, всего задач: 12, затрачено часов: 1.5, среднее время выполнения 0,125 часа.
